/* Задача 1. 
Пользователь вводит число N (N > 0). 
Программа должна вывести N единиц на экран.

N = 4 -> 1, 1, 1, 1
N = 2 -> 1, 1    */

/*Console.WriteLine();
Console.WriteLine("__________________");
Console.WriteLine("Задача 1 доп.");

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine()); */

int a = 5;
int count = 0;
int b = 0;
if (count >= a)
{
    while (b = a / a);
           a = a - 1;
    count++;
    Console.Write(b + " ");
}

